mcheah/Marlin4MPMD/MPMD_3dPrinter/STM32F4xx_LerdgeX/stm32f4xx_lerdgex.c
/******************************************************************************
                            BUS OPERATIONS
*******************************************************************************/
//#ifdef ADAFRUIT_TFT_JOY_SD_ID802
//
/******************************* SPI ********************************/
#ifdef HAL_SPI_MODULE_ENABLED

/**
  * @brief  Initializes SPI MSP.
  */
static void SPIx_MspInit(SPI_HandleTypeDef *hspi)
{
  GPIO_InitTypeDef  GPIO_InitStruct;

  /*** Configure the SPI peripheral ***/
  /* Enable SPI clock */
  NUCLEO_SPIx_CLK_ENABLE();

  /*** Configure the GPIOs ***/
  /* Enable GPIO clock */
  NUCLEO_SPIx_SCK_GPIO_CLK_ENABLE();
  NUCLEO_SPIx_MISO_MOSI_GPIO_CLK_ENABLE();

  /* Configure SPI SCK */
  GPIO_InitStruct.Pin = NUCLEO_SPIx_SCK_PIN;
#ifndef SOFTWARE_SPI
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
#else
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
#endif
  GPIO_InitStruct.Pull  = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  GPIO_InitStruct.Alternate = NUCLEO_SPIx_SCK_AF;
  HAL_GPIO_Init(NUCLEO_SPIx_SCK_GPIO_PORT, &GPIO_InitStruct);

  /* Configure SPI MISO and MOSI */
  GPIO_InitStruct.Pin = NUCLEO_SPIx_MOSI_PIN;
#ifndef SOFTWARE_SPI
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
#else
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
#endif
  GPIO_InitStruct.Alternate = NUCLEO_SPIx_MISO_MOSI_AF;
  GPIO_InitStruct.Pull  = GPIO_NOPULL;
  HAL_GPIO_Init(NUCLEO_SPIx_MISO_MOSI_GPIO_PORT, &GPIO_InitStruct);

  GPIO_InitStruct.Pin = NUCLEO_SPIx_MISO_PIN;
#ifndef SOFTWARE_SPI
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
#else
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
#endif
//  GPIO_InitStruct.Pull  = GPIO_NOPULL;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  HAL_GPIO_Init(NUCLEO_SPIx_MISO_MOSI_GPIO_PORT, &GPIO_InitStruct);


}

/**
  * @brief  Initializes SPI HAL.
  */
static void SPIx_Init(void)
{
 if(HAL_SPI_GetState(&hnucleo_Spi) == HAL_SPI_STATE_RESET)
 {
   /* SPI Config */
   hnucleo_Spi.Instance = NUCLEO_SPIx;
   /* SPI configuration contraints
         - ST7735 LCD SPI interface max baudrate is 15MHz for write and 6.66MHz for read
           Since the provided driver doesn't use read capability from LCD, only constraint
           on write baudrate is considered.
         - SD card SPI interface max baudrate is 25MHz for write/read
      to feat these constraints SPI baudrate is set to:
	      - For STM32F412ZG devices: 12,5 MHz maximum (PCLK2/SPI_BAUDRATEPRESCALER_8 = 100 MHz/8 = 12,5 MHz)
		  - For STM32F446ZE/STM32F429ZI devices: 11,25 MHz maximum (PCLK2/SPI_BAUDRATEPRESCALER_8 = 90 MHz/8 = 11,25 MHz)
   */
#ifdef USE_FAST_SPI
    hnucleo_Spi.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_2;
#else
    hnucleo_Spi.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_32;
#endif
   hnucleo_Spi.Init.Direction = SPI_DIRECTION_2LINES;
   hnucleo_Spi.Init.CLKPhase = SPI_PHASE_2EDGE;
   hnucleo_Spi.Init.CLKPolarity = SPI_POLARITY_HIGH;
    hnucleo_Spi.Init.CRCCalculation = SPI_CRCCALCULATION_DISABLE;
   hnucleo_Spi.Init.CRCPolynomial = 7;
   hnucleo_Spi.Init.DataSize = SPI_DATASIZE_8BIT;
   hnucleo_Spi.Init.FirstBit = SPI_FIRSTBIT_MSB;
   hnucleo_Spi.Init.NSS = SPI_NSS_SOFT;
    hnucleo_Spi.Init.TIMode = SPI_TIMODE_DISABLE;
   hnucleo_Spi.Init.Mode = SPI_MODE_MASTER;

   SPIx_MspInit(&hnucleo_Spi);
#ifndef SOFTWARE_SPI
   HAL_SPI_Init(&hnucleo_Spi);
   __HAL_SPI_ENABLE(&hnucleo_Spi);
#endif
 }
}

static uint8_t SWSPISendReceive(uint8_t txdata) {
  uint8_t rxdata = 0;
  uint8_t txxdata = 0;
  // no interrupts during byte send - about 8 us
BSP_LED_Toggle(LED3);
//  cli();
  for (uint8_t i = 0; i < 8; i++) {
	GPIO_PinState level = txdata & 0X80 ? GPIO_PIN_SET : GPIO_PIN_RESET;
	if(level==GPIO_PIN_SET)
		txxdata |= 1;
	HAL_GPIO_WritePin(NUCLEO_SPIx_MISO_MOSI_GPIO_PORT,NUCLEO_SPIx_MOSI_PIN,level);
	HAL_GPIO_WritePin(NUCLEO_SPIx_SCK_GPIO_PORT,NUCLEO_SPIx_SCK_PIN,GPIO_PIN_RESET);
//    fastDigitalWrite(SPI_SCK_PIN, LOW);

//    fastDigitalWrite(SPI_MOSI_PIN, txdata & 0X80);
	delay_basic(50e-6);
//	HAL_Delay(1);
//    nop;
//    nop;

    txdata <<= 1;
	rxdata <<= 1;
	txxdata <<= 1;
	if(HAL_GPIO_ReadPin(NUCLEO_SPIx_MISO_MOSI_GPIO_PORT,NUCLEO_SPIx_MISO_PIN)==GPIO_PIN_SET)
//    if (fastDigitalRead(SPI_MISO_PIN))
    	rxdata |= 1;
	HAL_GPIO_WritePin(NUCLEO_SPIx_SCK_GPIO_PORT,NUCLEO_SPIx_SCK_PIN,GPIO_PIN_SET);
//    fastDigitalWrite(SPI_SCK_PIN, HIGH);
//	HAL_Delay(1);
	delay_basic(50e-6);

  }
//  HAL_Delay(1);
	delay_basic(50e-6);

  // hold SCK high for a few ns
//  nop;
//  nop;
//  nop;
//  nop;

  HAL_GPIO_WritePin(NUCLEO_SPIx_SCK_GPIO_PORT,NUCLEO_SPIx_SCK_PIN,GPIO_PIN_SET);
  // enable interrupts
//  sei();
  return rxdata;
}
/**
 * @brief  SPI Write a byte to device
 * @param  DataIn: value to be written
 * @param  DataOut: value to read
 * @param  DataLegnth: length of data
 */
static void SPIx_Write(uint8_t Value) {
	 HAL_StatusTypeDef status = HAL_OK;
#ifdef USE_FAST_SPI
	 status = HAL_SPI_Transmit_Byte(&hnucleo_Spi,Value,SpixTimeout);
#else
	 status = HAL_SPI_Transmit(&hnucleo_Spi, &Value,1,SpixTimeout);
	 if(status != HAL_OK)
	 {
	   /* Execute user timeout callback */
	   SPIx_Error();
	 }
#endif
}
/**
 * @brief  SPI Write a byte to device
 * @param  DataIn: value to be written
 * @param  DataOut: value to read
 * @param  DataLegnth: length of data
 */
static uint8_t SPIx_WriteRead(uint8_t Value) {
	 HAL_StatusTypeDef status = HAL_OK;
	 uint8_t tmp;
#ifdef USE_FAST_SPI
	 status = HAL_SPI_TransmitReceive_Byte(&hnucleo_Spi,Value,&tmp,SpixTimeout);
#else
	 status = HAL_SPI_TransmitReceive(&hnucleo_Spi, &Value,&tmp,1,SpixTimeout);
	 if(status != HAL_OK)
	 {
	   /* Execute user timeout callback */
	   SPIx_Error();
	 }
#endif
	 return tmp;
}

/**
 * @brief  SPI Write a byte to device
 * @param  DataIn: value to be written
 * @param  DataOut: value to read
 * @param  DataLegnth: length of data
 */
static void SPIx_WriteReadData(const uint8_t *DataIn, uint8_t *DataOut, uint16_t DataLength)
{
 HAL_StatusTypeDef status = HAL_OK;

#ifdef USE_FAST_SPI
    status = HAL_SPI_TransmitReceive_Fast(&hnucleo_Spi, (uint8_t*) DataIn, DataOut, DataLength, SpixTimeout);
#elif SOFTWARE_SPI
  for(uint16_t i=0;i<DataLength;i++)
  {
	  DataOut[i] = SWSPISendReceive(DataIn[i]);
  }
#else
  status = HAL_SPI_TransmitReceive(&hnucleo_Spi, (uint8_t*) DataIn, DataOut, DataLength, SpixTimeout);
 /* Check the communication status */
  if(status != HAL_OK)
  {
    /* Execute user timeout callback */
    SPIx_Error();
  }
#endif
}

/**
 * @brief  SPI Write a byte to device.
 * @param  Value: value to be written
 */
static void SPIx_WriteData(uint8_t *DataIn, uint16_t DataLength)
{
  HAL_StatusTypeDef status = HAL_OK;

#ifdef USE_FAST_SPI
	  status = HAL_SPI_Transmit_Fast(&hnucleo_Spi, DataIn, DataLength, SpixTimeout);
#else
  	  status = HAL_SPI_Transmit(&hnucleo_Spi, DataIn, DataLength, SpixTimeout);
	  if(status != HAL_OK)
	  {
	      /* Execute user timeout callback */
	      SPIx_Error();
	  }
#endif
  /* Check the communication status */

