mcheah/Marlin4MPMD/MPMD_3dPrinter/STM32F4xx_LerdgeX/stm32f4xx_lerdgex.c
}

static void SPIx_ReadData(uint8_t *DataOut, uint16_t DataLength) {
	HAL_StatusTypeDef status = HAL_OK;
#ifdef USE_FAST_SPI
	status = HAL_SPI_Receive_Fast2(&hnucleo_Spi,DataOut,DataLength,SpixTimeout);
#else
	memset(DataOut,SD_DUMMY_BYTE,DataLength);
	status = HAL_SPI_Receive(&hnucleo_Spi,DataOut,DataLength,SpixTimeout);
	if(status != HAL_OK)
	{
	    /* Execute user timeout callback */
	    SPIx_Error();
	}
#endif
}

///**
//  * @brief  SPI Write a byte to device
//  * @param  Value value to be written
//  * @retval None
//  */
//static void SPIx_Write(uint8_t Value)
//{
//  HAL_StatusTypeDef status = HAL_OK;
//  uint8_t data;
//
//  status = HAL_SPI_TransmitReceive(&hnucleo_Spi, (uint8_t*) &Value, &data, 1, SpixTimeout);
//
//  /* Check the communication status */
//  if(status != HAL_OK)
//  {
//    /* Execute user timeout callback */
//    SPIx_Error();
//  }
// }

/**
  * @brief  SPIx_FlushFifo
  * @retval None
  */
static void SPIx_FlushFifo(void)
{

  HAL_SPIEx_FlushRxFifo(&hnucleo_Spi);
}
/**
 * @brief  SPI error treatment function
 */
static void SPIx_Error (void)
{
 /* De-initialize the SPI communication BUS */
 HAL_SPI_DeInit(&hnucleo_Spi);

 /* Re-Initiaize the SPI communication BUS */
 SPIx_Init();
}

/******************************************************************************
                           LINK OPERATIONS
*******************************************************************************/

/********************************* LINK SD ************************************/
/**
 * @brief  Initializes the SD Card and put it into StandBy State (Ready for
 *         data transfer).
 */
void SD_IO_Init(void)
{
 GPIO_InitTypeDef  GPIO_InitStruct;
 uint8_t counter;

 /* SD_CS_GPIO Periph clock enable */
 SD_CS_GPIO_CLK_ENABLE();

 /* Configure SD_CS_PIN pin: SD Card CS pin */
 GPIO_InitStruct.Pin = SD_CS_PIN;
 GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
 GPIO_InitStruct.Pull = GPIO_PULLUP;

  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
 HAL_GPIO_Init(SD_CS_GPIO_PORT, &GPIO_InitStruct);



 /*------------Put SD in SPI mode--------------*/
 /* SD SPI Config */
 SPIx_Init();

 /* SD chip select high */
 SD_CS_HIGH();

 /* Send dummy byte 0xFF, 10 times with CS high */
 /* Rise CS and MOSI for 80 clocks cycles */
 for (counter = 0; counter <= 9; counter++)
 {
   /* Send dummy byte 0xFF */
   SD_IO_WriteByte(SD_DUMMY_BYTE);
 }
}

/**
 * @brief  Set the SD_CS pin.
 * @param  val: pin value.
 */
void SD_IO_CSState(uint8_t val)
{
 if(val == 1)
 {
   SD_CS_HIGH();
 }
 else
 {
   SD_CS_LOW();
 }
//  delay_basic(50e-6);
}

/**
 * @brief  Write a byte on the SD.
 * @param  DataIn: byte to send.
 * @param  DataOut: byte to read
 * @param  DataLength: length of data
 */
void SD_IO_WriteReadData(const uint8_t *DataIn, uint8_t *DataOut, uint16_t DataLength)
{
 /* Send the byte */
 SPIx_WriteReadData(DataIn, DataOut, DataLength);
}
#if 0
uint8_t SD_IO_WriteByte(uint8_t Data)
{
 uint8_t tmp;

 /* Send the byte */
 SPIx_WriteReadData(&Data,&tmp,1);
 return tmp;
}

/**
  * @brief  Write a byte on the SD.
  * @param  Data byte to send.
  * @retval Data written
  */
uint8_t SD_IO_WriteReadByte(uint8_t Data)
{
//  uint8_t tmp;

  /* Send the byte */
	return SD_IO_WriteByte(Data);
//  return SPIx_WriteData(&Data,&tmp,1);
//  return tmp;
}
#else
/**
  * @brief  Write a byte on the SD.
  * @param  Data byte to send.
  * @retval Data written
 */
void SD_IO_WriteByte(uint8_t Data)
{
 /* Send the byte */
 SPIx_Write(Data);
}
/**
  * @brief  Write a byte on the SD.
  * @param  Data byte to send.
  * @retval Data written
  */
uint8_t SD_IO_WriteReadByte(uint8_t Data)
{
  /* Send the byte */
	return SPIx_WriteRead(Data);
}
#endif
/**
  * @brief  Write an amount of data on the SD.
  * @param  DataOut byte to send.
  * @param  DataLength number of bytes to write
  * @retval none
  */
void SD_IO_ReadData(uint8_t *DataOut, uint16_t DataLength)
{
  /* Send the byte */
//  SD_IO_WriteReadData(DataOut, DataOut, DataLength);
	SPIx_ReadData(DataOut,DataLength);
}

/**
  * @brief  Write an amount of data on the SD.
  * @param  Data byte to send.
  * @param  DataLength number of bytes to write
  * @retval none
  */
void SD_IO_WriteData(const uint8_t *Data, uint16_t DataLength)
{
  /* Send the byte */
  SPIx_WriteData((uint8_t *)Data, DataLength);
  SPIx_FlushFifo();
}
///********************************* LINK LCD ***********************************/
///**
//  * @brief  Initializes the LCD
//  */
//void LCD_IO_Init(void)
//{
//  GPIO_InitTypeDef  GPIO_InitStruct;
//
//  /* LCD_CS_GPIO and LCD_DC_GPIO Periph clock enable */
//  LCD_CS_GPIO_CLK_ENABLE();
//  LCD_DC_GPIO_CLK_ENABLE();
//
//  /* Configure LCD_CS_PIN pin: LCD Card CS pin */
//  GPIO_InitStruct.Pin = LCD_CS_PIN;
//  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
//  GPIO_InitStruct.Pull = GPIO_NOPULL;
//  GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
//  HAL_GPIO_Init(LCD_CS_GPIO_PORT, &GPIO_InitStruct);
//
//  /* Configure LCD_DC_PIN pin: LCD Card DC pin */
//  GPIO_InitStruct.Pin = LCD_DC_PIN;
//  HAL_GPIO_Init(LCD_DC_GPIO_PORT, &GPIO_InitStruct);
//
//  /* LCD chip select high */
//  LCD_CS_HIGH();
//
//  /* LCD SPI Config */
//  SPIx_Init();
//}
//
///**
//  * @brief  Writes command to select the LCD register.
//  * @param  LCDReg: Address of the selected register.
//  */
//void LCD_IO_WriteReg(uint8_t LCDReg)
//{
//  /* Reset LCD control line CS */
//  LCD_CS_LOW();
//
//  /* Set LCD data/command line DC to Low */
//  LCD_DC_LOW();
//
//  /* Send Command */
//  SPIx_Write(LCDReg);
//
//  /* Deselect : Chip Select high */
//  LCD_CS_HIGH();
//}
//
///**
//  * @brief  Writes data to select the LCD register.
//  *         This function must be used after st7735_WriteReg() function
//  * @param  Data: data to write to the selected register.
//  */
//void LCD_IO_WriteData(uint8_t Data)
//{
//  /* Reset LCD control line CS */
//  LCD_CS_LOW();
//
//  /* Set LCD data/command line DC to High */
//  LCD_DC_HIGH();
//
//  /* Send Data */
//  SPIx_Write(Data);
//
//  /* Deselect : Chip Select high */
//  LCD_CS_HIGH();
//}
//
///**
//  * @brief  Write register value.
//  * @param  pData Pointer on the register value
//  * @param  Size Size of byte to transmit to the register
//  */
//void LCD_IO_WriteMultipleData(uint8_t *pData, uint32_t Size)
//{
//  uint32_t counter = 0;
//  __IO uint32_t data = 0;
//
//  /* Reset LCD control line CS */
//  LCD_CS_LOW();
//
//  /* Set LCD data/command line DC to High */
//  LCD_DC_HIGH();
//
//  if (Size == 1)
//  {
//    /* Only 1 byte to be sent to LCD - general interface can be used */
//    /* Send Data */
//    SPIx_Write(*pData);
//  }
//  else
//  {
//    /* Several data should be sent in a raw */
//    /* Direct SPI accesses for optimization */
//    for (counter = Size; counter != 0; counter--)
//    {
//      while(((hnucleo_Spi.Instance->SR) & SPI_FLAG_TXE) != SPI_FLAG_TXE)
//      {
//      }
//      /* Need to invert bytes for LCD*/
//      *((__IO uint8_t*)&hnucleo_Spi.Instance->DR) = *(pData+1);
//
//      while(((hnucleo_Spi.Instance->SR) & SPI_FLAG_TXE) != SPI_FLAG_TXE)
//      {
//      }
//      *((__IO uint8_t*)&hnucleo_Spi.Instance->DR) = *pData;
//      counter--;
//      pData += 2;
//    }
//
//    /* Wait until the bus is ready before releasing Chip select */
//    while(((hnucleo_Spi.Instance->SR) & SPI_FLAG_BSY) != RESET)
//    {
//    }
//  }
//
//  /* Empty the Rx fifo */
//  data = *(&hnucleo_Spi.Instance->DR);
//  UNUSED(data);  /* Remove GNU warning */
//
//  /* Deselect : Chip Select high */
//  LCD_CS_HIGH();
//}
//
///**
//  * @brief  Wait for loop in ms.
//  * @param  Delay in ms.
//  */
//void LCD_Delay(uint32_t Delay)
//{
//  HAL_Delay(Delay);
//}
#endif /* HAL_SPI_MODULE_ENABLED */

///******************************* ADC driver ********************************/
//#ifdef HAL_ADC_MODULE_ENABLED
//
///**
//  * @brief  Initializes ADC MSP.
//  */
//static void ADCx_MspInit(ADC_HandleTypeDef *hadc)
//{
//  GPIO_InitTypeDef  GPIO_InitStruct;
//
//  /*** Configure the GPIOs ***/
//  /* Enable GPIO clock */
//  NUCLEO_ADCx_GPIO_CLK_ENABLE();
//
//  /* Configure the selected ADC Channel as analog input */
//  GPIO_InitStruct.Pin = NUCLEO_ADCx_GPIO_PIN ;
//  GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
//  GPIO_InitStruct.Pull = GPIO_NOPULL;
//  HAL_GPIO_Init(NUCLEO_ADCx_GPIO_PORT, &GPIO_InitStruct);
//
//  /*** Configure the ADC peripheral ***/
//  /* Enable ADC clock */
//  NUCLEO_ADCx_CLK_ENABLE();
//}
//
///**
//  * @brief  DeInitializes ADC MSP.
//  * @note ADC DeInit does not disable the GPIO clock
//  */
//static void ADCx_MspDeInit(ADC_HandleTypeDef *hadc)
//{
//  GPIO_InitTypeDef  GPIO_InitStruct;
//
//  /*** DeInit the ADC peripheral ***/
//  /* Disable ADC clock */
//  NUCLEO_ADCx_CLK_DISABLE();
//
//  /* Configure the selected ADC Channel as analog input */
//  GPIO_InitStruct.Pin = NUCLEO_ADCx_GPIO_PIN ;
//  HAL_GPIO_DeInit(NUCLEO_ADCx_GPIO_PORT, GPIO_InitStruct.Pin);
//
//  /* Disable GPIO clock has to be done by the application*/
//  /* NUCLEO_ADCx_GPIO_CLK_DISABLE(); */
//}
//
///**
//  * @brief  Initializes ADC HAL.
//  */
//static void ADCx_Init(void)
//{
//  if(HAL_ADC_GetState(&hnucleo_Adc) == HAL_ADC_STATE_RESET)
//  {
//    /* ADC Config */
//    hnucleo_Adc.Instance                   = NUCLEO_ADCx;
//    hnucleo_Adc.Init.ClockPrescaler        = ADC_CLOCKPRESCALER_PCLK_DIV4; /* (must not exceed 36MHz) */
//    hnucleo_Adc.Init.Resolution            = ADC_RESOLUTION12b;
//    hnucleo_Adc.Init.DataAlign             = ADC_DATAALIGN_RIGHT;
//    hnucleo_Adc.Init.ContinuousConvMode    = DISABLE;
//    hnucleo_Adc.Init.DiscontinuousConvMode = DISABLE;
//    hnucleo_Adc.Init.ExternalTrigConvEdge  = ADC_EXTERNALTRIGCONVEDGE_NONE;
//    hnucleo_Adc.Init.EOCSelection          = EOC_SINGLE_CONV;
//    hnucleo_Adc.Init.NbrOfConversion       = 1;
//    hnucleo_Adc.Init.DMAContinuousRequests = DISABLE;
//
//    ADCx_MspInit(&hnucleo_Adc);
//    HAL_ADC_Init(&hnucleo_Adc);
//  }
//}
//
///**
//  * @brief  Initializes ADC HAL.
//  */
//static void ADCx_DeInit(void)
//{
//  hnucleo_Adc.Instance   = NUCLEO_ADCx;
//
//  HAL_ADC_DeInit(&hnucleo_Adc);
//  ADCx_MspDeInit(&hnucleo_Adc);
//}
//
///******************************* LINK JOYSTICK ********************************/
//
///**
//  * @brief  Configures joystick available on adafruit 1.8" TFT shield
//  *         managed through ADC to detect motion.
//  * @retval Joystickstatus (0=> success, 1=> fail)
//  */
//uint8_t BSP_JOY_Init(void)
//{
//  uint8_t status = HAL_ERROR;
//
//  ADCx_Init();
//
//  /* Select the ADC Channel to be converted */
//  sConfig.Channel      = NUCLEO_ADCx_CHANNEL;
//  sConfig.SamplingTime = ADC_SAMPLETIME_3CYCLES;
//  sConfig.Rank         = 1;
//  status = HAL_ADC_ConfigChannel(&hnucleo_Adc, &sConfig);
//
//  /* Return Joystick initialization status */
//  return status;
//}
//
///**
//  * @brief  DeInit joystick GPIOs.
//  * @note   JOY DeInit does not disable the Mfx, just set the Mfx pins in Off mode
//  */
//void BSP_JOY_DeInit(void)
//{
//  ADCx_DeInit();
//}
//
///**
//  * @brief  Returns the Joystick key pressed.
//  * @note   To know which Joystick key is pressed we need to detect the voltage
//  *         level on each key output
//  *           - None  : 3.3 V / 4095
//  *           - SEL   : 1.055 V / 1308
//  *           - DOWN  : 0.71 V / 88
//  *           - LEFT  : 3.0 V / 3720
//  *           - RIGHT : 0.595 V / 737
//  *           - UP    : 1.65 V / 2046
//  * @retval JOYState_TypeDef: Code of the Joystick key pressed.
//  */
//JOYState_TypeDef BSP_JOY_GetState(void)
//{
//  JOYState_TypeDef state;
//  uint16_t  keyconvertedvalue = 0;
//
//  /* Start the conversion process */
//  HAL_ADC_Start(&hnucleo_Adc);
//
//  /* Wait for the end of conversion */
//  HAL_ADC_PollForConversion(&hnucleo_Adc, 10);
//
//  /* Check if the continuous conversion of regular channel is finished */
//  if((HAL_ADC_GetState(&hnucleo_Adc) & HAL_ADC_STATE_EOC_REG) == HAL_ADC_STATE_EOC_REG)
//  {
//    /* Get the converted value of regular channel */
//    keyconvertedvalue = HAL_ADC_GetValue(&hnucleo_Adc);
//  }
//
//  if((keyconvertedvalue > 2010) && (keyconvertedvalue < 2090))
//  {
//    state = JOY_UP;
//  }
//  else if((keyconvertedvalue > 680) && (keyconvertedvalue < 780))
//  {
//    state = JOY_RIGHT;
//  }
//  else if((keyconvertedvalue > 1270) && (keyconvertedvalue < 1350))
//  {
//    state = JOY_SEL;
//  }
//  else if((keyconvertedvalue > 50) && (keyconvertedvalue < 130))
//  {
//    state = JOY_DOWN;
//  }
//  else if((keyconvertedvalue > 3680) && (keyconvertedvalue < 3760))
//  {
//    state = JOY_LEFT;
//  }
//  else
//  {
//    state = JOY_NONE;
//  }
//
//  /* Loop while a key is pressed */
//  if(state != JOY_NONE)
//  {
//    keyconvertedvalue = HAL_ADC_GetValue(&hnucleo_Adc);
//  }
//  /* Return the code of the Joystick key pressed */
//  return state;
//}
//#endif /* HAL_ADC_MODULE_ENABLED */
//
//#endif /* ADAFRUIT_TFT_JOY_SD_ID802 */


/**
  * @}
  */ 

/**
  * @}
  */

/**
  * @}
  */    

/**
  * @}
  */ 
#endif
void LCD_GPIO_Init(void) {
	/* Enable FSMC, GPIOD, GPIOE, GPIOF, GPIOG and AFIO clocks */
	GPIO_InitTypeDef GPIO_InitStructure;
	__HAL_RCC_FSMC_CLK_ENABLE();
	__HAL_RCC_GPIOB_CLK_ENABLE();
	__HAL_RCC_GPIOD_CLK_ENABLE();
	__HAL_RCC_GPIOE_CLK_ENABLE();
	  /* Set PD.00(D2), PD.01(D3), PD.04(NOE), PD.05(NWE), PD.08(D13), PD.09(D14),
	     PD.10(D15), PD.14(D0), PD.15(D1) as alternate
	     function push pull */
	//Init GPIOD FSMC pins
	GPIO_InitStructure.Pin = LCD_FSMC_D_PINS;
	GPIO_InitStructure.Mode = GPIO_MODE_AF_PP;
	GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	GPIO_InitStructure.Pull = GPIO_NOPULL;
	GPIO_InitStructure.Alternate = LCD_FSMC_AF;
	HAL_GPIO_Init(GPIOD,&GPIO_InitStructure);
	//Init GPIOE FSMC pins
	GPIO_InitStructure.Pin = LCD_FSMC_E_PINS;
	HAL_GPIO_Init(GPIOE,&GPIO_InitStructure);
	//Init output pins
	GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStructure.Alternate = GPIO_AF0_MCO;
	GPIO_InitStructure.Pin = LCD_TOUCHEN_PIN;
	HAL_GPIO_Init(LCD_TOUCHEN_GPIO_PORT,&GPIO_InitStructure);
	HAL_GPIO_WritePin(LCD_TOUCHEN_GPIO_PORT,LCD_TOUCHEN_PIN,GPIO_PIN_SET);

	GPIO_InitStructure.Pin = LCD_BACKLIGHT_PIN | LCD_RST_PIN | LCD_BUZZ_PIN;
	HAL_GPIO_Init(GPIOD,&GPIO_InitStructure);
	HAL_GPIO_WritePin(LCD_BACKLIGHT_GPIO_PORT,LCD_BACKLIGHT_PIN,GPIO_PIN_SET);
	HAL_GPIO_WritePin(LCD_RST_GPIO_PORT,LCD_RST_PIN,GPIO_PIN_SET);
	HAL_GPIO_WritePin(LCD_BUZZ_GPIO_PORT,LCD_BUZZ_PIN,GPIO_PIN_RESET);

	GPIO_InitStructure.Mode = GPIO_MODE_INPUT;
	GPIO_InitStructure.Pin = LCD_BTN_PIN | LCD_ENC1_PIN | LCD_ENC2_PIN;
	GPIO_InitStructure.Pull = GPIO_PULLUP;
	GPIO_InitStructure.Speed = GPIO_SPEED_LOW;
	HAL_GPIO_Init(GPIOE,&GPIO_InitStructure);

