mcheah/Marlin4MPMD/MPMD_3dPrinter/STM32F4xx_LerdgeX/stm32f4xx_lerdgex.c
}
SRAM_HandleTypeDef hsram;
FSMC_NORSRAM_TimingTypeDef SRAM_Timing;
void LCD_FSMC_Init(void) {
	hsram.Instance = FSMC_NORSRAM_DEVICE;
	hsram.Extended = FSMC_NORSRAM_EXTENDED_DEVICE;

	/*-- FSMC Configuration ------------------------------------------------------*/
	/* FSMC_Bank1_NORSRAM1 timing configuration */
	SRAM_Timing.AddressSetupTime = 5;
	SRAM_Timing.AddressHoldTime = 0;
	SRAM_Timing.DataSetupTime = 5;
	SRAM_Timing.BusTurnAroundDuration = 0;
	SRAM_Timing.CLKDivision = 0;
	SRAM_Timing.DataLatency = 0;
	SRAM_Timing.AccessMode = FSMC_ACCESS_MODE_A;
	/* FSMC_Bank1_NORSRAM4 configured as follows:
		- Data/Address MUX = Disable
		- Memory Type = SRAM
		- Data Width = 16bit
		- Write Operation = Enable
		- Extended Mode = Disable
		- Asynchronous Wait = Disable */
	hsram.Init.NSBank = FSMC_NORSRAM_BANK1;
	hsram.Init.DataAddressMux = FSMC_DATA_ADDRESS_MUX_DISABLE;
	hsram.Init.MemoryType = FSMC_MEMORY_TYPE_SRAM;
	hsram.Init.MemoryDataWidth = FSMC_NORSRAM_MEM_BUS_WIDTH_16;
	hsram.Init.BurstAccessMode = FSMC_BURST_ACCESS_MODE_DISABLE;
	hsram.Init.WaitSignalPolarity = FSMC_WAIT_SIGNAL_POLARITY_LOW;
	hsram.Init.WrapMode = FSMC_WRAP_MODE_DISABLE;
	hsram.Init.WaitSignalActive = FSMC_WAIT_TIMING_BEFORE_WS;
	hsram.Init.WriteOperation = FSMC_WRITE_OPERATION_ENABLE;
	hsram.Init.WaitSignal = FSMC_WAIT_SIGNAL_DISABLE;
	hsram.Init.ExtendedMode = FSMC_EXTENDED_MODE_ENABLE;
	hsram.Init.WriteBurst = FSMC_WRITE_BURST_DISABLE;

	HAL_SRAM_Init(&hsram,&SRAM_Timing,&SRAM_Timing);

}

void BSP_LCD_Init(void) {
	LCD_GPIO_Init();
	LCD_FSMC_Init();
}
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
